app/controllers/posts_controller.rb

  def new
    @post = Post.new
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("user_id", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["title", "good morning"], ["body", "very good morning to all my friends."], ["created_at", "2019-02-14 15:58:45.654920"], ["updated_at", "2019-02-14 15:58:45.654920"]]